AGuerra0122/Driver_GPIO_ESP32_E2/components/GPIO_E2/GPIO_E2.c
 // FileName:        GPIO_E2.c
 // Dependencies:    None
 // Processor:       ESP32
 // Board:           ESP32
 // Program version: Espressif 2.7.0
 // Company:         Espressif
 // Description:
 // Authors:         Jesús Adrián Guerra Delgado
 //                  Andrew Joshua Barrientos Lonzo
 //                  Jaime Alejandro Herrera Armendariz
 // Updated:         12/2022
/*
 * SPDX-FileCopyrightText: 2015-2021 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
/*********Librerias necesarias**********/
#include <esp_types.h>
#include "esp_err.h"
#include "freertos/FreeRTOS.h"
#include "GPIO_E2.h"
#include "driver/rtc_io.h"
#include "soc/soc.h"
#include "soc/periph_defs.h"
#if !CONFIG_FREERTOS_UNICORE
#include "esp_ipc.h"
#endif

#include "soc/soc_caps.h"
#include "soc/gpio_periph.h"
#include "esp_log.h"
#include "esp_check.h"
#include "../../DRIVERS/GPIO_HAL.h"
#include "esp_rom_gpio.h"

static const char *GPIO_TAG = "gpio";
#define GPIO_CHECK(a, str, ret_val) ESP_RETURN_ON_FALSE(a, ret_val, GPIO_TAG, "%s", str)

#define GPIO_ISR_CORE_ID_UNINIT    (3)
//El valor default para SOC_GPIO_SUPPORT_RTC_INDEPENDENT es 0
#ifndef SOC_GPIO_SUPPORT_RTC_INDEPENDENT
#define SOC_GPIO_SUPPORT_RTC_INDEPENDENT 0
#endif

typedef struct {
    gpio_isr_t fn;   /*!< Funcion de isr */
    void *args;      /*!< args dela funcion de isr */
} gpio_isr_func_t;
// Usado por la llamada IPC para registrar la rutin del servicio de interrupcion
typedef struct {
    int source;               /*!< Source de ISR */
    int intr_alloc_flags;     /*!< ISR flag de alloc */
    void (*fn)(void*);        /*!< Funcion de ISR */
    void *arg;                /*!< args de funcion de ISR*/
    void *handle;             /*!< handle de ISR */
    esp_err_t ret;
} gpio_isr_alloc_t;

typedef struct {
    gpio_hal_context_t *gpio_hal;
    portMUX_TYPE gpio_spinlock;
    uint32_t isr_core_id;
    gpio_isr_func_t *gpio_isr_func;
    gpio_isr_handle_t gpio_isr_handle;
} gpio_context_t;
/**************************************************************************
* Function: gpio_hal_context_t
* Overview: Funcion que declara el contexto del HAL.
*
*****************************************************************************/
static gpio_hal_context_t _gpio_hal = {
    .dev = GPIO_HAL_GET_HW(GPIO_PORT_0)
};
/**************************************************************************
* Function: gpio_context_t
* Overview: Funcion que declara el contexto siendo este el hal, spinlock, core_id e isr_func.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static gpio_context_t gpio_context = {
    .gpio_hal = &_gpio_hal,
    .gpio_spinlock = portMUX_INITIALIZER_UNLOCKED,
    .isr_core_id = GPIO_ISR_CORE_ID_UNINIT,
    .gpio_isr_func = NULL,
};
/**************************************************************************
* Function: gpio_output_disable
* Preconditions: gpio_context_t
* Overview: Funcion que deshabilita el pin seleccionado como salida.
* Input: gpio_num.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_output_disable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_output_disable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}
/**************************************************************************
* Function: gpio_output_enable
* Preconditions: gpio_context_t
* Overview: Funcion que habilita el pin seleccionado como salida.
* Input: gpio_num.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_output_enable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_OUTPUT_GPIO(gpio_num), "GPIO output gpio_num error", ESP_ERR_INVALID_ARG);
    gpio_hal_output_enable(gpio_context.gpio_hal, gpio_num);
    esp_rom_gpio_connect_out_signal(gpio_num, SIG_GPIO_OUT_IDX, false, false);
    return ESP_OK;
}
/**************************************************************************
* Function: gpio_set_output
* Overview: Funcion que configura el pin seleccionado como salida.
* Input: gpio_num.
* Output: ret
*
*****************************************************************************/
esp_err_t gpio_set_output(gpio_num_t gpio_num){
	   GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

	    if ((GPIO_IS_VALID_OUTPUT_GPIO(gpio_num) != true) && (GPIO_MODE_DEF_OUTPUT)) {
	        ESP_LOGE(GPIO_TAG, "io_num=%d can only be input", gpio_num);
	        return ESP_ERR_INVALID_ARG;
	    }
	    esp_err_t ret = ESP_OK;
	    gpio_output_enable(gpio_num);
	    return ret;
}
/**************************************************************************
* Function: gpio_set_input_pullup
* Overview: Funcion que configura el pin como entrada y activa el pullup.
* Input: gpio_num.
* Output: ret
*
*****************************************************************************/
esp_err_t gpio_set_input_pullup(gpio_num_t gpio_num){
	 GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

	    if ((GPIO_IS_VALID_OUTPUT_GPIO(gpio_num) != true) && (GPIO_MODE_DEF_INPUT & GPIO_MODE_DEF_OUTPUT)) {
	        ESP_LOGE(GPIO_TAG, "io_num=%d can only be input", gpio_num);
	        return ESP_ERR_INVALID_ARG;
	    }
	    esp_err_t ret = ESP_OK;
	    gpio_hal_input_enable(gpio_context.gpio_hal, gpio_num);

	    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
	        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	        gpio_hal_pullup_act(gpio_context.gpio_hal, gpio_num);
	        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	    } else {
	#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
	        rtc_gpio_pullup_en(gpio_num);
	#else
	        abort(); // This should be eliminated as unreachable, unless a programming error has occured
	#endif
	    }

	    return ret;
}
/**************************************************************************
* Function: gpio_set_input_pulldown
* Overview: Funcion que habilita el pin seleccionado como entrada y activa el pulldown.
* Input: gpio_num.
* Output: ret
*
*****************************************************************************/
esp_err_t gpio_set_input_pulldown(gpio_num_t gpio_num){
	 GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

	    if ((GPIO_IS_VALID_OUTPUT_GPIO(gpio_num) != true) && (GPIO_MODE_DEF_INPUT & GPIO_MODE_DEF_OUTPUT)) {
	        ESP_LOGE(GPIO_TAG, "io_num=%d can only be input", gpio_num);
	        return ESP_ERR_INVALID_ARG;
	    }
	    esp_err_t ret = ESP_OK;
	    gpio_hal_input_enable(gpio_context.gpio_hal, gpio_num);

	    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
	        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	        gpio_hal_pulldown_act(gpio_context.gpio_hal, gpio_num);
	        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	    } else {
	#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
	        rtc_gpio_pulldown_en(gpio_num);
	#else
	        abort(); // This should be eliminated as unreachable, unless a programming error has occured
	#endif
	    }

	    return ret;
}
/**************************************************************************
* Function: gpio_set_input_isr
* Overview: Funcion que configura el pin como entrada y permite configurar las interrupciones.
* Input: gpio_num
* 		 isr_type
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_set_input_isr(gpio_num_t gpio_num, gpio_int_type_t isr_type){
	gpio_config_t pGPIOConfig;
	pGPIOConfig.pin_bit_mask = (1ULL << gpio_num);
	pGPIOConfig.mode = GPIO_MODE_DEF_INPUT;
	pGPIOConfig.pull_up_en = GPIO_PULLUP_DISABLE;
	pGPIOConfig.pull_down_en = GPIO_PULLDOWN_DISABLE;
	pGPIOConfig.intr_type = isr_type;

	gpio_config(&pGPIOConfig);

	return ESP_OK;
}

