AGuerra0122/Driver_GPIO_ESP32_E2/components/GPIO_E2/GPIO_E2.c
/**************************************************************************
* Function: gpio_act_left_op
* Preconditions: gpio_context_t
* Overview: Funcion que activa las salidas del lado izquierdo del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_left_op(void){
	gpio_hal_act_left_op(gpio_context.gpio_hal);
	esp_rom_gpio_connect_out_signal(12, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(13, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(14, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(25, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(26, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(27, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(32, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(33, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(34, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(35, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(36, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(39, SIG_GPIO_OUT_IDX, false, false);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_left_op
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva los pines del lado izquierdo del chip como salidas.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_left_op(void){
	gpio_hal_deact_left_op(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_right_op
* Preconditions: gpio_context_t
* Overview: Funcion que activa los pines del lado derecho del chip como salida.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_right_op(void){
	gpio_hal_act_right_op(gpio_context.gpio_hal);
	esp_rom_gpio_connect_out_signal(1, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(2, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(3, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(4, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(5, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(15, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(16, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(17, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(18, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(19, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(21, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(22, SIG_GPIO_OUT_IDX, false, false);
	esp_rom_gpio_connect_out_signal(23, SIG_GPIO_OUT_IDX, false, false);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_right_op
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva las los pines del lado derecho del chip como salidas..
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_right_op(void){
	gpio_hal_deact_right_op(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_left_ip
* Preconditions: gpio_context_t
* Overview: Funcion que activa los pines del lado izquierdo del chip como entradas.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_left_ip(void){
	gpio_hal_act_left_ip(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_left_ip
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva los pines del lado izquierdo del chip como entradas.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_left_ip(void){
	gpio_hal_deact_left_ip(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_right_ip
* Preconditions: gpio_context_t
* Overview: Funcion que activa los pines del lado derecho del chip como entradas.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_right_ip(void){
	gpio_hal_act_right_ip(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_right_ip
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva los pines del lado derecho del chip como entradas.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_right_ip(void){
	gpio_hal_deact_right_ip(gpio_context.gpio_hal);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_left_pulldown
* Preconditions: gpio_context_t
* Overview: Funcion que activa las resistencias de pulldown del lado izquierdo del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_left_pulldown(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_act_left_pulldown(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_left_pulldown
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva las resistencias de pulldown del lado izquierdo del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_left_pulldown(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_deact_left_pulldown(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_right_pulldown
* Preconditions: gpio_context_t
* Overview: Funcion que activa las resistencias de pulldown del lado derecho del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_right_pulldown(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_act_right_pulldown(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_right_pulldown
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva las resistencias de pulldown del lado derecho del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_right_pulldown(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_deact_right_pulldown(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_left_pullup
* Preconditions: gpio_context_t
* Overview: Funcion que activa las resistencias de pullup del lado izquierdo del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_left_pullup(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_act_left_pullup(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_left_pullup
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva las resistencias de pullup del lado izquierdo del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_left_pullup(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_deact_left_pullup(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_act_right_pullup
* Preconditions: gpio_context_t
* Overview: Funcion que activa las resistencias de pullup del lado derecho del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_act_right_pullup(void){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_act_right_pullup(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_deact_right_pullup
* Preconditions: gpio_context_t
* Overview: Funcion que desactiva las resistencias de pullup del lado derecho del chip.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_deact_right_pullup(){
	portENTER_CRITICAL(&gpio_context.gpio_spinlock);
	gpio_hal_deact_right_pullup(gpio_context.gpio_hal);
	portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_reset_right
* Overview: Funcion que resetea los pines del lado derecho del chip a su estado default.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_reset_right(void){
	assert(1);
    gpio_config_t cfg_1 = {
        .pin_bit_mask = BIT64(1),
        .mode = GPIO_MODE_DISABLE,
        //Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_1);
    gpio_config_t cfg_2 = {
        .pin_bit_mask = BIT64(2),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_2);
    gpio_config_t cfg_3 = {
        .pin_bit_mask = BIT64(3),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_3);
    gpio_config_t cfg_4 = {
        .pin_bit_mask = BIT64(4),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_4);
    gpio_config_t cfg_5 = {
        .pin_bit_mask = BIT64(5),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_5);
    gpio_config_t cfg_15 = {
        .pin_bit_mask = BIT64(15),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_15);
    gpio_config_t cfg_16 = {
        .pin_bit_mask = BIT64(16),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_16);
    gpio_config_t cfg_17 = {
        .pin_bit_mask = BIT64(17),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_17);
    gpio_config_t cfg_18 = {
        .pin_bit_mask = BIT64(18),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_18);
    gpio_config_t cfg_19 = {
        .pin_bit_mask = BIT64(19),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_19);
    gpio_config_t cfg_21 = {
        .pin_bit_mask = BIT64(21),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_21);
    gpio_config_t cfg_22 = {
        .pin_bit_mask = BIT64(22),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_22);
    gpio_config_t cfg_23 = {
        .pin_bit_mask = BIT64(23),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_23);
	return ESP_OK;
}
/**************************************************************************
* Function: gpio_reset_izquierdo
* Overview: Funcion que resetea los pines del lado izquierdo del chip a su estado default.
* Output: ESP_OK
*
*****************************************************************************/
esp_err_t gpio_reset_left(void){
	assert(1);
    gpio_config_t cfg_12 = {
        .pin_bit_mask = BIT64(12),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_12);
    gpio_config_t cfg_13 = {
        .pin_bit_mask = BIT64(13),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_13);
    gpio_config_t cfg_14 = {
        .pin_bit_mask = BIT64(14),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_14);
    gpio_config_t cfg_25 = {
        .pin_bit_mask = BIT64(25),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_25);
    gpio_config_t cfg_26 = {
        .pin_bit_mask = BIT64(26),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_26);
    gpio_config_t cfg_27 = {
        .pin_bit_mask = BIT64(27),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_27);
    gpio_config_t cfg_32 = {
        .pin_bit_mask = BIT64(32),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_32);
    gpio_config_t cfg_33 = {
        .pin_bit_mask = BIT64(33),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_33);
    gpio_config_t cfg_34 = {
        .pin_bit_mask = BIT64(34),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_34);
    gpio_config_t cfg_35 = {
        .pin_bit_mask = BIT64(35),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_35);
    gpio_config_t cfg_36 = {
        .pin_bit_mask = BIT64(36),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_36);
    gpio_config_t cfg_39 = {
        .pin_bit_mask = BIT64(39),
        .mode = GPIO_MODE_DISABLE,
		//Por razones de ahorro de energia, el GPIO no deberia estar flotando, se selecciona pullup
        .pull_up_en = true,
        .pull_down_en = false,
        .intr_type = GPIO_INTR_DISABLE,
    };
    gpio_config(&cfg_39);
	return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_pullup_en(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
        gpio_hal_pullup_act(gpio_context.gpio_hal, gpio_num);
        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    } else {
#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
        rtc_gpio_pullup_en(gpio_num);
#else
        abort(); // This should be eliminated as unreachable, unless a programming error has occured
#endif
    }

    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_pullup_dis(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
        gpio_hal_pullup_deact(gpio_context.gpio_hal, gpio_num);
        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    } else {
#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
        rtc_gpio_pullup_dis(gpio_num);
#else
        abort(); // This should be eliminated as unreachable, unless a programming error has occured
#endif
    }

    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_pulldown_en(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
        gpio_hal_pulldown_act(gpio_context.gpio_hal, gpio_num);
        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    } else {
#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
        rtc_gpio_pulldown_en(gpio_num);
#else
        abort(); // This should be eliminated as unreachable, unless a programming error has occured
#endif
    }

    return ESP_OK;
}

esp_err_t gpio_pulldown_dis(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);

    if (!rtc_gpio_is_valid_gpio(gpio_num) || SOC_GPIO_SUPPORT_RTC_INDEPENDENT) {
        portENTER_CRITICAL(&gpio_context.gpio_spinlock);
        gpio_hal_pulldown_deact(gpio_context.gpio_hal, gpio_num);
        portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    } else {
#if SOC_RTCIO_INPUT_OUTPUT_SUPPORTED
        rtc_gpio_pulldown_dis(gpio_num);
#else
        abort(); // This should be eliminated as unreachable, unless a programming error has occured
#endif
    }

    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_set_intr_type(gpio_num_t gpio_num, gpio_int_type_t intr_type)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    GPIO_CHECK(intr_type < GPIO_INTR_MAX, "GPIO interrupt type error", ESP_ERR_INVALID_ARG);

