AGuerra0122/Driver_GPIO_ESP32_E2/components/GPIO_E2/GPIO_E2.c
    portENTER_CRITICAL(&gpio_context.gpio_spinlock);
    gpio_hal_set_intr_type(gpio_context.gpio_hal, gpio_num, intr_type);
    portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static esp_err_t gpio_intr_enable_on_core(gpio_num_t gpio_num, uint32_t core_id)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_intr_enable_on_core(gpio_context.gpio_hal, gpio_num, core_id);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_intr_enable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    portENTER_CRITICAL(&gpio_context.gpio_spinlock);
    if(gpio_context.isr_core_id == GPIO_ISR_CORE_ID_UNINIT) {
        gpio_context.isr_core_id = xPortGetCoreID();
    }
    portEXIT_CRITICAL(&gpio_context.gpio_spinlock);
    return gpio_intr_enable_on_core (gpio_num, gpio_context.isr_core_id);
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_intr_disable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_intr_disable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static esp_err_t gpio_input_disable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_input_disable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static esp_err_t gpio_input_enable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_input_enable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}

/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static esp_err_t gpio_od_disable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_od_disable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
static esp_err_t gpio_od_enable(gpio_num_t gpio_num)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    gpio_hal_od_enable(gpio_context.gpio_hal, gpio_num);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_set_level(gpio_num_t gpio_num, uint32_t level)
{
    GPIO_CHECK(GPIO_IS_VALID_OUTPUT_GPIO(gpio_num), "GPIO output gpio_num error", ESP_ERR_INVALID_ARG);
    gpio_hal_set_level(gpio_context.gpio_hal, gpio_num, level);
    return ESP_OK;
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
int gpio_get_level(gpio_num_t gpio_num)
{
    return gpio_hal_get_level(gpio_context.gpio_hal, gpio_num);
}
/**************************************************************************
* Function: Nombre de la función
* Preconditions: Qué funciones o declaraciones son previas al programa
* Overview: resumen del programa.
* Input: argumentos de entrada.
* Output: argumentos de salida
*
*****************************************************************************/
esp_err_t gpio_set_pull_mode(gpio_num_t gpio_num, gpio_pull_mode_t pull)
{
    GPIO_CHECK(GPIO_IS_VALID_GPIO(gpio_num), "GPIO number error", ESP_ERR_INVALID_ARG);
    GPIO_CHECK(pull <= GPIO_FLOATING, "GPIO pull mode error", ESP_ERR_INVALID_ARG);
    esp_err_t ret = ESP_OK;

